#### Terraform Plan: No changes

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_assume_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:luperr/lw-profile:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.github_s3_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_s3_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-lw-profile"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.github_s3_access will be created
  + resource "aws_iam_role_policy" "github_s3_access" {
      + id          = (known after apply)
      + name        = "github-actions-s3-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.s3Dev.data.aws_iam_policy_document.cloudflare_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudflare_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudflareGetObject"

          + condition {
              + test     = "IpAddress"
              + values   = [
                  + "173.245.48.0/20",
                  + "103.21.244.0/22",
                  + "103.22.200.0/22",
                  + "103.31.4.0/22",
                  + "141.101.64.0/18",
                  + "108.162.192.0/18",
                  + "190.93.240.0/20",
                  + "188.114.96.0/20",
                  + "197.234.240.0/22",
                  + "198.41.128.0/17",
                  + "162.158.0.0/15",
                  + "104.16.0.0/13",
                  + "104.24.0.0/14",
                  + "172.64.0.0/13",
                  + "131.0.72.0/22",
                  + "2400:cb00::/32",
                  + "2606:4700::/32",
                  + "2803:f800::/32",
                  + "2405:b500::/32",
                  + "2405:8100::/32",
                  + "2a06:98c0::/29",
                  + "2c0f:f248::/32",
                ]
              + variable = "aws:SourceIp"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.s3Dev.aws_s3_bucket.s3Bucket will be created
  + resource "aws_s3_bucket" "s3Bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev.lachlannwhitehill.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-4"
      + request_payer               = (known after apply)
      + tags                        = {
          + "env"     = "dev"
          + "project" = "dev.lachlannwhitehill.com"
        }
      + tags_all                    = {
          + "env"     = "dev"
          + "project" = "dev.lachlannwhitehill.com"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3Dev.aws_s3_bucket_acl.s3BucketAcl will be created
  + resource "aws_s3_bucket_acl" "s3BucketAcl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-4"

      + access_control_policy (known after apply)
    }

  # module.s3Dev.aws_s3_bucket_ownership_controls.s3BucketOwnership will be created
  + resource "aws_s3_bucket_ownership_controls" "s3BucketOwnership" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-4"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3Dev.aws_s3_bucket_policy.s3BucketPolicy will be created
  + resource "aws_s3_bucket_policy" "s3BucketPolicy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-southeast-4"
    }

  # module.s3Dev.aws_s3_bucket_public_access_block.s3BucketAccess will be created
  + resource "aws_s3_bucket_public_access_block" "s3BucketAccess" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "ap-southeast-4"
      + restrict_public_buckets = false
    }

  # module.s3Dev.aws_s3_bucket_versioning.s3BucketVersioning will be created
  + resource "aws_s3_bucket_versioning" "s3BucketVersioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-4"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

  # module.s3Dev.aws_s3_bucket_website_configuration.s3_bucket_website_config will be created
  + resource "aws_s3_bucket_website_configuration" "s3_bucket_website_config" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "ap-southeast-4"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.s3Prod.data.aws_iam_policy_document.cloudflare_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudflare_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudflareGetObject"

          + condition {
              + test     = "IpAddress"
              + values   = [
                  + "173.245.48.0/20",
                  + "103.21.244.0/22",
                  + "103.22.200.0/22",
                  + "103.31.4.0/22",
                  + "141.101.64.0/18",
                  + "108.162.192.0/18",
                  + "190.93.240.0/20",
                  + "188.114.96.0/20",
                  + "197.234.240.0/22",
                  + "198.41.128.0/17",
                  + "162.158.0.0/15",
                  + "104.16.0.0/13",
                  + "104.24.0.0/14",
                  + "172.64.0.0/13",
                  + "131.0.72.0/22",
                  + "2400:cb00::/32",
                  + "2606:4700::/32",
                  + "2803:f800::/32",
                  + "2405:b500::/32",
                  + "2405:8100::/32",
                  + "2a06:98c0::/29",
                  + "2c0f:f248::/32",
                ]
              + variable = "aws:SourceIp"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.s3Prod.aws_s3_bucket.s3Bucket will be created
  + resource "aws_s3_bucket" "s3Bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "lachlannwhitehill.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-4"
      + request_payer               = (known after apply)
      + tags                        = {
          + "env"     = "prod"
          + "project" = "lachlannwhitehill.com"
        }
      + tags_all                    = {
          + "env"     = "prod"
          + "project" = "lachlannwhitehill.com"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3Prod.aws_s3_bucket_acl.s3BucketAcl will be created
  + resource "aws_s3_bucket_acl" "s3BucketAcl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-4"

      + access_control_policy (known after apply)
    }

  # module.s3Prod.aws_s3_bucket_ownership_controls.s3BucketOwnership will be created
  + resource "aws_s3_bucket_ownership_controls" "s3BucketOwnership" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-4"

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3Prod.aws_s3_bucket_policy.s3BucketPolicy will be created
  + resource "aws_s3_bucket_policy" "s3BucketPolicy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-southeast-4"
    }

  # module.s3Prod.aws_s3_bucket_public_access_block.s3BucketAccess will be created
  + resource "aws_s3_bucket_public_access_block" "s3BucketAccess" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "ap-southeast-4"
      + restrict_public_buckets = false
    }

  # module.s3Prod.aws_s3_bucket_versioning.s3BucketVersioning will be created
  + resource "aws_s3_bucket_versioning" "s3BucketVersioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-4"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

  # module.s3Prod.aws_s3_bucket_website_configuration.s3_bucket_website_config will be created
  + resource "aws_s3_bucket_website_configuration" "s3_bucket_website_config" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "ap-southeast-4"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>